In [10]:
sqldf('''
SELECT name FROM scores WHERE test_1_score < 75 OR test_2_score < 75 AND test_10_score < 75;
''')

        name
0       Noah
1        Ava
2    William
3     Elijah
4  Charlotte
5      Lucas
6      Mason
7     Harper